INSERT INTO Жанр
VALUES(1, 'рэп'), (2, 'рок'), (3, 'хип-хоп'), (4, 'фанк'), (5, 'джаз'), (6, 'блюз');

INSERT INTO Исполнитель
VALUES(1, 'Баста'), (2, 'Jah Khalib'), (3, 'Guf'), (4, 'Джиган'), (5, 'Король и шут'), (6, 'Linkin Park'),
(7, 'MiyaGi & Andy Panda'), (8, '25/17'), (9, 'The Cat Empire'), (10, 'SAULT'), 
(11, 'Louis Armstrong'), (12, 'There Will Be Blood');

INSERT INTO Жанр_Исполнитель
VALUES(1,1), (1,2), (1,3), (1,4), (2,5), (2,6), (3,7), (3,8), (4,9), (4,10), (5,11), (6,12);

INSERT INTO Альбом 
VALUES(1,'Баста 3',2010), (2,'Баха и Дмитрий Карантино',2020), (3,'HEAVY TRAFFIC',2019), (4,'На чиле',2021), 
(5,'Будь как дома путник!',1997), (6,'TODD. Акт 2. На краю',2012), (7,'Meteora',2003), (8,'Патрон',2021), 
(9,'Голова чтобы думать',2016), (10,'Просто',2016), (11,'Cities',2021), (12,'Today & Tomorrow',2022),
(13,'What A Wonderful World',1968), (14,'Horns',2008);

INSERT INTO Исполнитель_Альбом
VALUES(1,1), (2,2), (3,3), (4,4), (5,5), (5,6), (6,7), (7,8), (8,9), (8,10), (9,11), (10,12), (11,13), (12,14);

INSERT INTO Трэк 
VALUES(1, 'Урбан','00:04:12',1), (2, 'На своём вайбе','00:02:59',2), (3, 'Авиарежим','00:03:58',3),
(4, 'На чиле','00:05:41',4), (5, 'Лесник','00:03:11',5), (6, 'Маленький остров','00:02:50',6),
(7, 'На краю','00:04:05',6), (8, 'Faint','00:02:46',7), (9, 'Патрон','00:03:45',8),
(10, 'Голова чтобы думать','00:03:35',9), (11, 'Черная касса','00:03:53',10), (12, 'Boogaloo','00:03:30',11), 
(13, 'Run','00:03:38',12),(14, 'What A Wonderful World','00:02:19',13),
(15, 'Short Breath','00:04:31',14),(16, 'Reviever','00:04:43',14);

INSERT INTO Сборник
VALUES(1,'Хиты FM 2010',2010), (2,'100 лучших песен 2020 года',2020), (3,'HEAVY TRAFFIC',2019), 
(4,'100 суперхитов',2021), (5,'Легенды русского рока',1997), (6,'Рок хиты 2012',2012), 
(7,'Liberation: Songs to Benefit PETA',2003), (8,'Топ 100 лучших русских песен 2021',2021),
(9,'Голова чтобы думать',2016), (10,'Супер хиты',2016),
(11,'Музыка мира',2021), (12,'Супер сборник хитов',2022),
(13,'Звезда джаза',1968), (14,'Exceptions to Reality',2008);

INSERT INTO Трэк_Сборник 
VALUES(1,1), (2,2), (3,3), (4,4), (5,5), (6,6), (7,6), (8,7), 
(9,8), (10,9), (11,10), (12,11), (13,12), (14,13), (15,14), (16,14);


