-- название и год выхода альбомов, вышедших в 2019 году;
SELECT * FROM Альбом
	WHERE год_выпуска=2019;

-- название и продолжительность самого продолжительного трека;
SELECT название, длительность FROM Трэк
	ORDER BY длительность DESC 
	LIMIT 1;

-- название треков, продолжительность которых не менее 3,5 минут;
SELECT название, длительность FROM Трэк
	WHERE длительность >= '00:03:30';

-- названия сборников, вышедших в период с 2016 по 2020 год с ограничениями;
SELECT * FROM Альбом
	WHERE год_выпуска >= 2016 and год_выпуска <= 2020;

-- исполнители, чье имя состоит из 1 слова;
select имя FROM Исполнитель
	WHERE имя NOT LIKE  '%% %%';
-- название треков, которое содержит слово "мой"/"my".
SELECT название FROM Трэк
	WHERE название LIKE '%%Урбан%%';
	
SELECT название FROM Трэк
	WHERE название LIKE '%%my%%';
